tap "homebrew/bundle"

# most commonly used
brew "git" # Git version control (latest version)
brew "git-delta" # a better git diff
brew "lazygit" # a better git UI
brew "vim" # Vim (latest)
brew "neovim" # A better vim
brew "grep" # grep (latest)
brew "chezmoi"
brew "htop" # a top alternative
brew "neofetch" # pretty system info
brew "tree" # pretty-print directory contents
brew "tmux" # terminal multiplexer
brew "python" # python (latest)
brew "glow" # markdown viewer
brew "highlight" # code syntax highlighting
brew "fastlane"
brew "ncdu"
cask "packages"


brew "bat" # better cat
brew "cloc" # lines of code counter
brew "entr" # file watcher / command runner
brew "fd" # find alternative
brew "fnm" # Fast Node version manager
brew "fzf" # Fuzzy file searcher, used in scripts and in vim
brew "gh" # GitHub CLI
brew "gnupg" # GPG
brew "jq" # work with JSON files in shell scripts
brew "ripgrep" # very fast file searcher
brew "shellcheck" # diagnostics for shell sripts
brew "stylua" # lua code formatter
brew "wdiff" # word differences in text files
brew "wget" # internet file retriever
brew "z" # switch between most used directories
brew "zoxide" # switch between most used directories
brew "zsh" # zsh (latest)
brew "youtube-dl"
brew "yt-dlp"
